nota-credito-reverso/src/main/resources/templates/request.vm

<soapenv:Envelope 	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header 	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	</soap:Header>
	<soapenv:Body>
		<sch:doCreditAccountRevRq 	xmlns:sch="http://itau.com.co/services/accounts/creditaccount/v1/schemas" xmlns:sch1="http://itau.com.co/commoncannonical/v2/schemas">
			<sch:HeaderRequest>
				<sch1:MessageHeader>
					<sch1:MessageKey>
						<sch1:requestUUID>$!{headers.requestUUID}</sch1:requestUUID>
					</sch1:MessageKey>
					<sch1:MessageInfo>
						<sch1:dateTime>$!{headers.dateTime}</sch1:dateTime>
						<sch1:systemId>$!{headers.systemId}</sch1:systemId>
						<sch1:originatorName>$!{headers.originatorName}</sch1:originatorName>
						<sch1:originatorType>$!{headers.originatorType}</sch1:originatorType>
						<sch1:terminalId>$!{headers.terminalId}</sch1:terminalId>
					</sch1:MessageInfo>
					<sch1:TrnInfoList>
						<sch1:TrnInfo>
							<sch1:trnCode>$!{headers.transaction_id}</sch1:trnCode>
							<sch1:trnSrc>$!{headers.trnSrc}</sch1:trnSrc>
						</sch1:TrnInfo>
					</sch1:TrnInfoList>
				</sch1:MessageHeader>
			</sch:HeaderRequest>
			${body}
		</sch:doCreditAccountRevRq>
	</soapenv:Body>
</soapenv:Envelope>